{
// Special

"Hakan.Intro": "Hello, @, I heard you were the new farmer that moved in. Name's Hakan. I actually work at the adventurers guild but Marlon called me back. #$b#See, the monsters in the mines have been riled up for some reason. #$b#But don't worry, I'm here to help keep them under control. See you around, farmer.",
"Hakan.GreenRain": "Green rain... I heard it was good for the environment but its awful for my nose.",
"Hakan.GreenRain_2": "",
"Hakan.GreenRainFinished": "*sniff* My allergies are still awful. It will take days for them to clear out.",
"Hakan.Dumpsterdive": "...I hope you aren't eating that.",
"Hakan.cc_Complete": "I feel a great natural magic surrounding the valley. Your offerings have made the forest spirits happy, perhaps it will keep the monsters at bay.",
"Hakan.movietheatercreated": "The new movie theater looks amazing. It appeared overnight. I wonder what powers are capable of doing that?",
"Hakan.pamHouseUpgrade": "I heard you got Pam a new house. It looks so much better than that old trailer...Maybe I should ask Robin to fix up the cabin?",
"Hakan.pamHouseUpgradeAnonymous": "Hmph, I wonder who got Pam a new house. #$b^Hakan stares at you suspiciously. #$bWas it you?",
"Hakan.slingshot": "Hey! You really think it's good idea to try me?",
"Hakan.wipedmemory": "",

// Married other npcs dialogues

"Hakan.married.wizard": "I didn't expect you and the wizard to hitch up. Congrats!",
"Hakan.married.lance": "Heh, I'd say my old adventuring buddy scored with you.",
"Hakan.roommates.krobus": "I never thought you'd make a friend with a shadow person. I always thought that they just wanted to hurt us. Maybe there's more to them than I thought.",
"Hakan.married.abigail": "",
"Hakan.married.sam": "",
"Hakan.married.sophia": "",

// Dating other npcs dialogues

"Hakan.dating.sam": "",

// Bouquet Dialogues

"Hakan.AcceptBouquet": "",
"Hakan.RejectBouquetDivorced": "",
"Hakan.RejectBouquet_NpcAlreadyMarried": "",
"Hakan.RejectBouquet_VeryLowHearts": "",
"Hakan.RejectBouquet_LowHearts": "",
"Hakan.RejectBouquet": "",

// Mermaid Pendant

"Hakan.give_pendant":"",
"Hakan.RejectMermaidPendantDivorced": "",
"Hakan.RejectMermaidPendantNeedHouseUpgrade": "",
"Hakan.RejectMermaidPendantNotDatable": "",
"Hakan.RejectMermaidPendantNpcWithSomeoneElse": "",
"Hakan.RejectMermaidPendantPlayerWithSomeoneElse": "",
"Hakan.RejectMermaidPendantUnder8Hearts": "",
"Hakan.RejectMermaidPendantUnder10Hearts": "",
"Hakan.RejectMermaidPendantUnder10HeartsAskedAgain": "",
"Hakan.RejectMermaidPendant": "",

// Gift Tastes

"Gifts.Hakan.Loved": "Damn, you really know the way to a man's heart.",
"Gifts.Hakan.Liked": "Oh! For me? How thoughtful of you.",
"Gifts.Hakan.Disliked": "Um, no thanks.",
"Gifts.Hakan.Hated": "You can...get this thing out of my sight.",
"Gifts.Hakan.Neutral": "Thank you, I might find a use for this.",

// Specific Gift Dialogues

//Loved
"Gifts.Hakan.StardropTea": "Wow, this should increase my stamina greatly. #$b#Thanks, now I can keep you safer!",
"Gifts.Hakan.Woodskip": "*gasp* Woodskip! My favorite fish. He will go with the others in my pond.",
"Gifts.Hakan.AgedBlueMoonWine": "Ah, Sophia's specialty. I've always loved the taste. Thank you!",
"Gifts.Hakan.Butterfish": "Oh a Butterfish! It's almost too cute to fry up. #$b#Almost...",
"Gifts.Hakan.FishLoved": "Oh look at the scales on this one...thank you!",
"Gifts.Hakan.Stingray": "Hey, is that a Stingray? As beautiful as they are, make sure you watch out for their barbed tail.",
"Gifts.Hakan.DishOSea": "Oh hey! My favorite food before a day of fishing. How did you know?",

//Liked

"Gifts.Hakan.Tankdecor": "Woah, this would look amazing in my next aquascape. I'll be sure to show you sometime.",
"Gifts.Hakan.Pufferfish": "Oh wow a pufferfish? You know that highly trained chefs can make these toxic fish edible? #$b#I've heard they are to die for."in,
"Gifts.Hakan.FishLiked": "Heh. You know me. I won't say no to a nice fish.",
"Gifts.Hakan.Melon": "Plump and juicy...Just how I like em. Can't wait to sink my teeth into this!",

// Disliked

"Gifts.Hakan.Mayo": "Urgh...It's even worse up close. How does anyone find an egg based cream appetizing at all?",
"Gifts.Hakan.Pancakes": "Pancakes?... Urgh I know it's a favorite, but they are so unappealing. So bland and basic. ",

// Hated

"Gifts.Hakan.Eggplant": "Ugh. I never understood why it's so liked. Just look at its shape and name! It's disgusting.",
"Gifts.Hakan.Squid": "Oh...I'm sorry, but I'm allergic. Please keep it away from me next time.",
"Gifts.Hakan.RedMushroom": "Whoa you trying to poison me? Just looking at its shape makes me cringe. Don't get me started on imagining it in my mouth. ",

// Birthday

"Bday.Hakan.Positive": "Aw, a birthday gift for me? I'm glad you remembered.#$b#...Wait...Woah! I love this! #$b#How'd you know...",
"Bday.Hakan.Negative": "If this is some sort of joke, its not funny.",
"Bday.Hakan.Generic": "Aw, a birthday gift for me? I'm glad you remembered.",

// Other Gifting Dialogue

"Gifts.Hakan.RejectGiftDivorced":"",

// Movie Tickets

"Hakan.movie.RejectMovieTicketAlreadyInvitedBySomeoneElse":"",
"Hakan.movie.RejectMovieTicketAlreadyWatchedThisWeek":"",
"Hakan.movie.RejectMovieTicketDivorced":"",
"Hakan.movie.RejectMovieTicketDontWantToSeeThatMovie":"",
"Hakan.movie.RejectMovieTicket":"",

// Movie Reactions

"Hakan.movie.bravelilsapling_1": "Aw, look at him, hes adorable...",
"Hakan.movie.bravelilsapling_2": "Heh.",
"Hakan.movie.bravelilsapling_3": "Hah, what a nice message. We all have to face some hardships in life.",
"Hakan.movie.journeyofprairie_1": "Did you see the plants in the crane machine game? I want some...",
"Hakan.movie.journeyofprairie_2": "Oh wow, he managed to get out of that situation easily.",
"Hakan.movie.journeyofprairie_3": "Quick thinking by the protagonist.",
"Hakan.movie.mysterium_1": "Ah a scary movie? I ain't afraid.",
"Hakan.movie.mysterium_2": "*shivers*",
"Hakan.movie.mysterium_3": "That was horrifying...I'm glad the ghosts of the mines aren't as scary. I never gave their purpose much thought.",
"Hakan.movie.coldstarranch_1": "It's cold outside...I'm ready for a cozy movie.",
"Hakan.movie.coldstarranch_2": "*sniff* $b%Hakan has a somber look on his face.",
"Hakan.movie.coldstarranch_3": "Sorry, that movie brought up some old memories.",
"Hakan.movie.naturalwonders_1": "A movie about our natural world, I'm gonna love this.",
"Hakan.movie.naturalwonders_2": "Haha, crab rave!",
"Hakan.movie.naturalwonders_3": "I loved that documentary...The pigeons in Zuzu city were so cute.",
"Hakan.movie.wumbus_1": "A movie about an alien? This might be interesting.",
"Hakan.movie.wumbus_2": "Ewww...",
"Hakan.movie.wumbus_3": "What strange character designs.",
"Hakan.movie.ithowlsintherain_1": "Wait, its the noise we sometimes hear in the rain!",
"Hakan.movie.ithowlsintherain_2": "...&b%Hakan looks anxious",
"Hakan.movie.ithowlsintherain_3": "*sigh* And still, no one has answers for what that strange noise is.",
"Hakan.movie.zuzucity_1": "I'm not a huge fan of trains or old films, but this should be fun!",
"Hakan.movie.zuzucity_2": "*Snore* &b%Hakan fell asleep...",
"Hakan.movie.zuzucity_3": "*yawn* Is the movie over now?",

// Flower Dance

"Hakan.flowerdance": "I'm not really that interested in dancing. I'm just here for the food.",
"Hakan.flowerdance_accept": "O-Oh um... sure! Guess I can put down the food for a bit...Sorry in advanced for my clumsiness.",
"Hakan.flowerdance_accept_spouse": "...You are more important than the food. Of course.",
"Hakan.flowerdance_decline": "No, I'm hungry.",

// Festivals

"Hakan.eggfestival": "Why did Marnie make me hide all the eggs this year? She knows that I get hungry...",
"Hakan.luau": "When I was a kid I threw a sea cucumber into the soup... $eIt took a while for everyone to forgive me after that.",
"Hakan.moonjellies": "...Isn't it super weird that Pierre is selling merchandise at a jellyfish viewing? $e...and at many other town events. He's sacrificing these rare moments just to make a quick buck.",
"Hakan.fair": "*Homf nomf* $b%Hakan is too busy eating burgers.",
"Hakan.spirit": "It's kind of messed up that the guild captures monsters for the town's entertainment.#$b#I should've just dressed up as a vampire.",
"Hakan.ice": "Puh, you won't beat me at the fishing competition. I have the touch.$bFish can't resist my rod.",
"Hakan.winterstar": "I hope my recipient likes the gift I got them...",
"Hakan.nightmarket_1": "Yo, you should try the deep fishing on the submarine. I've caught some really unusual fish there!",
"Hakan.nightmarket_02": "I'm keeping an eye out on that Shrouded Figure. Can never be too careful.",
"Hakan.desertfestival_01": "I heard there are scorpion carps in the pond... I wonder if they sting.",
"Hakan.desertfestival_02": "Did you try some of the food from the chef over there? It was delicious.",

// Stardew Valley Fair Contest

"Hakan.JudgedPlayerLostPurpleShorts": "",
"Hakan.JudgedPlayerWon": "",
"Hakan.JudgedPlayerLost": "",

// Winter Star Gift Givin

// Married Festival Variants

"Hakan.eggfestival_spouse": "Hey you! *blushes* $bDon't worry, I smuggled some eggs for us to share at home. Heheheh.$eWe should cook something delicious up.",
"Hakan.flowerdance_spouse": "*Homf nomf* Hey handsome. You're lookin' almost as good as this meal right here. Almost.^*Homf nomf* Hey beautiful. You're lookin' almost as good as this meal right here. Almost.",
"Hakan.luau_spouse": "Hey sexy, why don't you lose the shirt and cuddle with me. I know you like it.$bOh wait, maybe we should eat first...",
"Hakan.moonjellies_spouse": "H-h...wow you look quite dashing under the moonlight. You stand out like the green jellyfish.",
"Hakan.fair_spouse": "*Homf nomf chomp chomp*&bOh! Hey handsome, wanna share some with me? Gus's burgers are fire.^*Homf nomf chomp chomp*&bOh! Hey beautiful, wanna share some with me? Gus's burgers are fire.",
"Hakan.spirit_spouse": "Heh, are you a skeleton? Cause I have a bone to pick with you.$b...What? We all have bones inside of us.",
"Hakan.ice_spouse": "Just because we are married doesn't I'm gonna go easy on you. They always want my rod.",
"Hakan.winterstar_spouse": "I may not be your secret gifter this year, but I have a *BIG* gift for you when we get home. Prepare yourself.",

// SVE COMMUNITY DAY:

"Hakan.cd_spring": "Caroline and I like to exchange our plant clippings here.",
"Hakan.cd_summer": "Willy told me some fishing secrets...$bNow I'm unstoppable.",
"Hakan.cd_fall": "I kind of feel like this building could be great for a guildhall...",
"Hakan.cd_winter": "I taught Abigail some sword moves... She's got a sense of adventure, but lacks experience.",

"Hakan.cd_married_spring": "*chuckles* do you think Pierre will stop hating me now that I'm taken?",
"Hakan.cd_married_summer": "Honey, was it you who put the community center together? I have a feeling...",
"Hakan.cd_married_fall": "Psst... Can you help me convince Clint to upgrade my weapons? I think he likes you better than me...",
"Hakan.cd_married_winter": "Hello my love. Do you want some hot chocolate? #$b#I made it extra special for you.",

// Heart Events

// Dating Dialogue

"Hakan.dating": "Uh, have you've seen any monsters lately? Cause I think I see one right now.#$b#Er....Sorry, I'm bad at this.",
"Hakan.dating_memory_oneday": "O-Oh hey honey... Sorry I'm trying to get used to this intimacy thing.",
"Hakan.dating_memory_oneyear": "It's been awhile... Don't you think we should take this relationship further?",
"Hakan.divorced": "...Sorry I can't look at you right now.",
"Hakan.breakup": "Really? Man that stings...I wish we could've worked out. I'm sorry I couldn't be a better boyfriend.",
"Hakan.dumped_boys": "Man, you really sleep around huh? Wild.",
"Hakan.second_chance": "...*sigh* I suppose we can try and make this work. I still have feelings for you after all.",

//Engagement Dialogues

// Marriage Dialogue

"Hakan.SpouseFarmhouseClutter": "",

//Use {0} for the other npc's name, and {1} for the item given.

"Hakan.SpouseGiftJealous": "",
"Hakan.MonstersInHouse": "Get behind me,",

"Hakan.patio": "Good Morning, @. Don't mind me, just gettin' these legs movin'.",
"Hakan.spouse_room": "Ah, it is so relaxing in here. Come, lets cuddle and watch a movie, dear.",
"Hakan.stardrop": "Hey handsome. I've got something special for you.^Hey beautiful. I've got something special for you.",

"Hakan.rainyday.01": "I love the smell of rain. Stay safe out there, I've been hearing something mysterious occasionally.",
"Hakan.rainyday.02": "The rain should wash all the pollen away. My nose will be feeling clear tomorrow.",
//"Hakan.rainyday.03": "Maybe the slimes will be out of the caves today?",
//"Hakan.rainyday.04": "I hope %pet doesn't track in mud...",
"Hakan.rainyday.05": "I'll be staying inside today. I don't want to get my fur wet, it's a nightmare to dry it out.",
"Hakan.rainyday.06": "Make sure to take an umbrella and stay dry. I don't want you getting a cold. I might smother you when I am warming you up!",
"Hakan.rainyday.07": "It's raining today... I wonder if there's any rare fish out.",

"Hakan.rainynight.01": "I love nights like these. Listening to the rain while cuddling my beautiful husband. Its the dream...bed now! ^I love nights like these. Listening to the rain while cuddling my beautiful wife. Its the dream...bed now!",
"Hakan.rainynight.02": "Hey dear, lets get to bed soon. I want to listen to you under the noise of the rain.",
"Hakan.rainynight.03": "Welcome home @, you must be hungry from all of the running around in the rain today. Don't worry, I have a cozy meal prepared to warm you up. [226 237 236]",
"Hakan.rainynight.04": "@, come here... I wanna hold you my love...",
"Hakan.rainynight.05": "Sometimes, I miss my parents. I hope they are doing alright out there. I wish I could introduce you.",
"Hakan.rainynight.06": "Please leave your shoes at the door, honey. I already cleaned up after %pet today.",

"Hakan.good.01": "Heh, I'm glad I hooked a catch like you...$bor did you hook me? $eWell, who did what doesn't matter. We are in this like together.",
"Hakan.good.02": "Why should I go fishing when I already caught someone like you?",
"Hakan.good.03": "Hey...@...guess what? $eI love you.",
"Hakan.good.04": "The farm looks like a lot of work, but you never ask me for help. Hey, I'm here for you if you need me to help. Just ask.",
"Hakan.good.05": "Can I have a kiss before you go?",
"Hakan.good.06": "You make me feel whole, secure. I hope to grow old together.",
"Hakan.good.07": "Hey, my sword is shining brighter today. *holds it up* Look, it can even reflect your handsome face!^Hey, my sword is shining brighter today. *holds it up* Look, it can even reflect your beautiful face!",

"Hakan.neutral.01": "I need to visit the guild soon. I'm low on adventuring supplies.",
"Hakan.neutral.02": "I swear, sometimes when I'm foraging near your grandfather's shrine... I hear whispering. I think there's something special about it.",
"Hakan.neutral.03": "Marlon took me under his wing when my parents mysteriously left. And now here I am, an adventurer fully trained to fight monsters. $eThere used to be more of us, but it's a risky profession.",
"Hakan.neutral.04": "I learned a little bit of magic from Marlon. I'm not the best at it but I can cast some useful spells...",
"Hakan.neutral.05": "Patrolling the town at night is so boring most of the time... the only rustling in the bushes I've heard were from Lewis and Marnie...- $b...You don't wanna know.",
"Hakan.neutral.06": "What do you think our future will be? Will we continue the cozy life on the farm, or go adventuring together?",
"Hakan.neutral.07": "I hope my fish are doing okay at my house. Willy helps me monitor them but its hard not being there 24/7.",

"Hakan.bad.01": "Am I not good enough for you?",
"Hakan.bad.02": "...Do you think I'm a good husband?",
"Hakan.bad.03": "Did I do something wrong?",
"Hakan.bad.04": "Sometimes, I feel like I'm invisible to you.",
"Hakan.bad.05": "We are never together anymore. I miss you.",
"Hakan.bad.06": "*sigh* My sword has been getting rusty lately...",
"Hakan.bad.07": "...$e...sorry.",

"Hakan.indoorday.01": "Hello my little woodskip, watcha' doing today?",
"Hakan.indoorday.02": "Hey darling, I made you some breakfast. It is the most important meal of the day after all. You need to keep your stamina up. [240 242 241]",
"Hakan.indoorday.03": "I'll be working inside the house today, see you later my love.",
"Hakan.indoorday.04": "I have a feeling you might go adventuring, so here, take some of my adventuring supplies. Stay safe out there! [773, 403, 772]",
"Hakan.indoorday.05": "I cleaned up the house a little for you, so you have one less thing to worry about when you get home tonight.",

"Hakan.indoornight.01": "You must be exhausted. Here, I whipped up some dinner for us. [244 242 907 905 240]",
"Hakan.indoornight.02": "I missed you, you must be tired. Come here, rest in my arms.",
"Hakan.indoornight.03": "I'm so happy to see you home, lets cuddle later tonight.",
"Hakan.indoornight.04": "Ahh I'm so eepy... I need to hold you.",
"Hakan.indoornight.05": "Welcome home, did you catch any interesting fish? A woodskip I hope?",

"Hakan.outdoor.01": "Ah, the air out here is really nice. It feels fresh and there's not much pollen out. It's lovely.",
"Hakan.outdoor.02": "I don't know much about about cultivating crops, but I love watching you work.",
"Hakan.outdoor.03": "I wonder what the fishing is like today? Maybe I'll try and catch some woodskips at the secret woods.",
"Hakan.outdoor.04": "I love watching the progress you've made on this farm. Every day, there just seems to be something new.",
"Hakan.outdoor.05": "Hey honey, stay safe out there, I'll be holding down the fort here. Just leave it to me.",

"Hakan.job_return.01": "Controlling the monsters was a bit exhausting. The slimes were crawling out of the mine today. I'll need lots of kisses tonight.",
"Hakan.job_leave.01": "I've got to do my rounds around town today. I'll see you later tonight love.",

"Hakan.fun_return.01": "I think I had a huge fish on the line today, but it broke my rod. I think I'm gonna need to fix my rod tonight. $bHeh...Can you help me out?",
"Hakan.fun_leave.01": "Hey I'm gonna go out fishing today. I hope I get some good catches.",

"Hakan.OneKid_1": "%kid1 is so cute... I wanna spoil them.",
"Hakan.OneKid_2": "I can't believe our family is expanding. I never thought I'd have my own child.",
"Hakan.OneKid_3": "%kid1 sure is stubborn. I have to show a lot of restraint, but sometimes I question if that's even necessary. $bI wonder who they get it from.",
"Hakan.OneKid_4": "Do you think I should start training %kid1 in the art of the sword? So they can defend themselves?",

"Hakan.TwoKids_1": "I love our children, lets make sure they grow up to be great people. Just as great as you.",
"Hakan.TwoKids_2": "I saw $kid1 and $kid2 wrestling earlier. It's adorable that $kid1 shows restraint with their little sibling. Melts my heart.",
"Hakan.TwoKids_3": "Maybe I should take the kids out on a fishing trip sometime? Do you think they are old enough for the secret woods?",
"Hakan.TwoKids_4": "I'm glad we grow much of the food that our children eat. They will grow up strong and healthy at this rate.",

"Hakan.married_spring": "",
"Hakan.married_summer": "",
"Hakan.married_fall": "",
"Hakan.married_winter": "",

"Hakan.summit": "Go get it, your reward.",

//Marriage specific days

//Dynamic Spouse Dialogues

// Ginger Island

"Hakan.resort_bar": "Ah, these tropical drinks are delicious, wanna try some?",
"Hakan.resort_entering": "Hopefully the tiger slimes stay away... I'd like to just relax.",
"Hakan.resort_leaving": "Phew, those tiger slimes are strong! I had to swing my sword several times to subdue them.$eI don't think I'll be swinging my sword anymore tonight.",
"Hakan.resort_shore": "...I wonder if there's any rare tropical fish here...",
"Hakan.resort_wander": "No tiger slimes yet... I'm glad they are staying away from the beach.",
"Hakan.resort_towel": "Ah, the sun feels so nice on my fur. Come here, you should sunbathe with me.",
"Hakan.resort_dance": "Ha-haw...Oh hey @! Just tryna get my squats in.",

// Normal Schedule dialogue
// Generic Dialogue for each day.

//Spring

"Hakan.Mon.Spring": "*sniffle* $b...Oh hi there! &bSorry, all the flowers blooming have made my allergies act up.",
"Hakan.Tues.Spring": "Bah, all the monsters are starting to get active again...",
"Hakan.Wed.Spring": "Have you've gone to the adventurers guild yet? I can smell the dust of the mines on you.",
"Hakan.Thurs.Spring": "I've been slaying slimes since I was a teenager. Marlon taught me the way of the sword when I was younger.",
"Hakan.Fri.Spring": "How have things been on the farm? No monsters have been spawning there I hope.",
"Hakan.Sat.Spring": "I wonder how my friend Lance is doing. We used to go on a lot of quests together.$bBut at some point, we both got good enough to do jobs solo.",
"Hakan.Sun.Spring": "I do admit, the trees are beautiful during the spring.",

//Summer

"Hakan.Mon.Summer": "Hey @, are you growing any blueberries on your farm?",
"Hakan.Tues.Summer": "Caroline got me into plants. I was inspired when I saw her greenhouse.",
"Hakan.Wed.Summer": "Have you've gone to the beach lately? Sometimes interesting things wash up.",
"Hakan.Thurs.Summer": "Thankfully the slimes get kind of sluggish during the summer, but the bugs man... the bugs!",
"Hakan.Fri.Summer": "Man, this heat is almost unbearable. I'm all sweaty.",
"Hakan.Sat.Summer": "I wonder if I can catch a pufferfish today. They are funny little guys. Or maybe a Tilapia, they are delicious.",
"Hakan.Sun.Summer": "Marlon is covering for me today. I'm free to do whatever I want.",

//Fall

"Hakan.Mon.Fall": "Fall is probably my favorite season. The trees are so colorful. Will you be growing pumpkins?",
"Hakan.Tues.Fall": "Monsters actually get pretty active during the fall. I wonder why?",
"Hakan.Wed.Fall": "*Yawn* I'm so sleepy today...Maybe I'll sleep in the forest after clearing out all the slimes.",
"Hakan.Thurs.Fall": "You know that shed south of the forest? I wonder who it belonged to.",
"Hakan.Fri.Fall": "Did you forage any mushrooms lately? I love collecting them for my various dishes.",
"Hakan.Sat.Fall": "Abigail sometimes gives me rocks in exchange for monster materials. $bI use them for decorations...",
"Hakan.Sun.Fall": "Don't expect me to howl at the moon...I know I'm a wolf but I don't feel compelled to do that.",

//Winter

"Hakan.Mon.Winter": "Winter makes me appreciate my thick fur more. I never really get cold.",
"Hakan.Tues.Winter": "Monsters tend to get sluggish during the winter...but I still patrol around just in case. They've been unpredictable lately.",
"Hakan.Wed.Winter": "I used to make snowmen with my parents during the winter...",
"Hakan.Thurs.Winter": "It's crazy to me how the train drops a bunch of supplies when it's passing through the valley. Why don't they put a cover on the containers?#$b#Well, at least it's free stuff for me.",
"Hakan.Fri.Winter": "I wonder if Willy will go ice fishing with me later...",
"Hakan.Sat.Winter": "Hey @, cold day today huh? Do you want to borrow my jacket? $bI don't really need it.",
"Hakan.Sun.Winter": "...$bHakan's mouth is frozen shut.$eWhat? It's cold outside...",

// Specific Days

"Hakan.doctorvisit":"",

//Days before holidays
"Hakan.Spring.12": "The egg festival is tomorrow... mmm eggs...",
"Hakan.Spring.14": "I can't wait to go to the desert festival, the skull caverns are so interesting!",
"Hakan.Spring.15": "Did you see the plants producing salmon berries? They make for a pretty good snack.",
"Hakan.Spring.23": "Ah the flower dance is tomorrow... I don't care much for dancing but I love the seasonal food that Marnie and Gus cook up for it.",
"Hakan.Summer.10": "So the Luau...what are you going to bring for it? $bMe? I'm gonna bring some fish I caught earlier!",
"Hakan.Spring.19": "Heh, tomorrow is the trout derby. Are you going to be competing in it? Better not see you lackin'. $bIf you lose, dont feel too bad, them fish love to get hooked by me. Heh.",
"Hakan.Fall.8": "Did you see the plants producing blackberries? I'm not too much of a fan of them but they are a good source of energy.",
"Hakan.Fall.15": "Hehehe...I'm gonna make Gus go out of business tomorrow...",
"Hakan.Fall.26": "Gotta go capture some monsters today...special request from Marlon.",
"Hakan.Winter.07": "Hey @, are you participating in the fishing tourney tomorrow? &bHeh, I'll gladly give you second place.",
"Hakan.Winter.11": "Tomorrow we will see a bunch of squid migrating in mass numbers... Gonna stock up",
"Hakan.Winter.14": "Maybe the night market will have some useful items for me...",
"Hakan.Winter.24": "I'm glad the town gets together for spirits eve. It prevents me from feeling lonely.",
"Hakan.Spring.1YR2": "Happy new year, @! I wonder what this year will bring?",

//Location Dialogues

//For specific locations. Tiles x y

"Hakan.Guild_Board": "I wonder if there's any worthwhile quests...",
"Hakan.Guild_Sword": "%Hakan is staring intently at the swords on display",
"Hakan.Stardropsaloon": "*monch monch* &b%Hakan is busy eating food.",
"Hakan.Stardropsaloon2": "Gus makes some of the best food. The spaghetti and salads go especially crazy.",
"Hakan.Ocean.1": "I feel at peace here.",
"Hakan.Ocean.2": "Ah the sea... it is very calming.",
"Hakan.Oceangazing": "Oh, hey @. I've been staring at the ocean. Sometimes I feel like I can get lost in it.",
"Hakan.Dock": "I love the ocean. @, wanna sit and watch the waves with me?",
"Hakan.WizardTower": "I wonder what magical things Marlon is up to?",
"Hakan.Patrol_01": "Hey, @! Stay safe out there.",
"Hakan.Patrol_02": "I heard rustling in the bushes...so I checked it out.#&b#It was just Marnie and Lewis...#&b#*shudders*...Freaks.",
"Hakan.AerobicsClass": "",

//For maps such as "Saloon" or "Seedshop"

"Hakan.Saloon": "",
"Hakan.Saloon2": "",
"Hakan.Saloon4": "",
"Hakan.Saloon6": "",
"Hakan.Saloon8": "",
"Hakan.Saloon10": "",

"Hakan.Woods": "",
"Hakan.Woods2": "",
"Hakan.Woods4": "",
"Hakan.Woods6": "",
"Hakan.Woods8": "",
"Hakan.Woods10": "",

"Hakan.SeedShop4": "",
"Hakan.SeedShop8": "",
"Hakan.SeedShop10": "",

"Hakan.Bathhouse": "",
"Hakan.Bathhouse2": "",
"Hakan.Bathhouse4": "",
"Hakan.Bathhouse6": "",
"Hakan.Bathhouse8": "",
"Hakan.Bathhouse10": "",

//Map Strings

"Strings.HakiCabin.1": "debug1",
"Strings.HakiCabin.2": "debug2",
"Strings.HakiCabin.3": "debug3",
"Strings.HakiCabin.4": "debug4",
"Strings.HakiCabin.5": "debug5",
"Strings.HakiCabin.6": "debug6",
"Strings.HakiCabin.7": "debug7",
"Strings.HakiCabin.8": "debug8",
"Strings.HakiCabin.9": "debug9",
"Strings.HakiCabin.10": "debug10",
"Strings.HakiCabin.11": "debug11",
"Strings.HakiCabin.12": "debug12",

"Strings.Foothills": "debug",
"Strings.FunnySilo.": "debug",
"Strings.FoothillsPathway": "debug"

} 