// Special

"Hakan.Intro": "Hello, @, I'm Hakan. I actually work at the adventurers guild but Marlon called me back.",
"Hakan.Intro2": "I heard you reached to bottom of the mines. Unfortunately, it's seems to have riled up the monsters.", 
"Hakan.Intro2": "But don't worry, I'm here to help keep them under control. Hope to see you around on my patrols!",
"Hakan.GreenRain": "Green rain... I heard it was good for the environment but its awful for my nose.",
"Hakan.GreenRainFinished": "*sniff* My allergies are awful today.",
"Hakan.Dumpsterdive": "...I hope you aren't eating that.",

// Gift Tastes

"Gifts.Hakan.Loved": "Damn, you know exactly the way to a man's heart.",
"Gifts.Hakan.Liked": "Oh! For me? How thoughtful of you.",
"Gifts.Hakan.Disliked": "Um, no thanks.",
"Gifts.Hakan.Hated": "You can...get this thing out of my sight.",
"Gifts.Hakan.Neutral": "Thank you, I might find a use for this.",

// Specific Gift Dialogues


// Birthday

"Bday.Hakan.Positive": "Aw, a birthday gift for me? I'm glad you remembered.",
"Bday.Hakan.Negative": "If this is some sort of joke, its not funny.",

// Movies

// Festivals

"Hakan.eggfestival": "Why did Marnie make me hide all the eggs this year? She knows that I get hungry..."
"Hakan.luau": "When I was a kid I threw a sea cucumber into the soup... $eIt took a while for everyone to forgive me after that."
"Hakan.moonjellies": "...Isn't it super weird that Pierre is selling merchandise at a jellyfish viewing? $e...and at many other town events. He's sacrificing these rare moments just to make a quick buck."
"Hakan.fair": "*Homf nomf* $b%Hakan is too busy eating burgers."
"Hakan.spirit": "It's kind of messed up that the guild captures monsters for the town's entertainment."
"Hakan.ice": "Puh, you won't beat me at the fishing competition. I have the touch."
"Hakan.winterstar": "I hope my recipient like the gift I got them. "
"Hakan.nightmarket": "Yo, you should try the deep fishing on the submarine. I've caught some really unusual fish there!"
"Hakan.flowerdance": "I'm not really that interested in dancing. I'm just here for the food."
"Hakan.flowerdance_accept": "O-Oh um... sure! Guess I can put down the food for a bit...Sorry in advanced for my clumsiness."
"Hakan.flowerdance_accept_spouse": "...You are more important than the food. Of course."
"Hakan.flowerdance_decline": "No, I'm hungry."

// Heart Events

// Ginger Island

